# DWFImportOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWFImportOptions Methods
DWFImportOptions Class See Also
---
The DWFImportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSheetViews | Get sheet views where DWF markups are imported. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetSheetViews | Set sheet views where DWF markups are imported. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace